//=============================================================================
//
// 背景処理 [base_mesh.h]
// Author : 切田海畝斗
//
//=============================================================================
#ifndef _BASE_MESH_H_
#define _BASE_MESH_H_
#pragma once

#include "main.h"

//*****************************************************************************
// 構造体宣言
//*****************************************************************************
struct Mesh {
	ID3D11Buffer*	m_VertexBuffer;	// 頂点バッファ
	ID3D11Buffer*	m_IndexBuffer;	// インデックスバッファ
	int				m_NumVertex;		//頂点数
	int				m_NumIndex;		//インデックス数
};

#endif // !_BASE_MESH_H_