//=============================================================================
//
// カーソル処理 [cursor.h]
// Author : 切田海畝斗
//
//=============================================================================
#ifndef _CURSOR_H_
#define _CURSOR_H_
#pragma once

#include "main.h"

//*****************************************************************************
// マクロ定義
//*****************************************************************************
#define VALUE_CURSOR	(1.0f)

//=============================================================================
// 構造体
//=============================================================================
class Cursor {
private:
	D3DXVECTOR2 m_Pos;
public:
	Cursor() :m_Pos({ SCREEN_CENTER_X,SCREEN_CENTER_Y }) {};
	~Cursor() = default;
	
	D3DXVECTOR2& RefCorsor(void);
	void MoveCursor(int value);
};


#endif // !_CURSOR_H_