//=============================================================================
//
// スコア処理 [score.h]
// Author : 切田海畝斗
//
//=============================================================================
#pragma once

#include "main.h"
#include "renderer.h"

//*****************************************************************************
// クラス宣言
//*****************************************************************************
class Score {
private:
	D3DXVECTOR2 m_Pos;
	D3DXVECTOR2 m_Scl;
	D3DXCOLOR m_Color;
	int m_Score;
public:
	Score();
	~Score();

	void AddScore(int value);
	void Draw(void);
};