//=============================================================================
//
// アイテム処理 [torus_item.h]
// Author : 切田海畝斗
//
//=============================================================================
#pragma once

#include <d3dx9.h>
#include "base_item.h"

//*****************************************************************************
// 前方宣言
//*****************************************************************************

//*****************************************************************************
// クラス宣言
//*****************************************************************************
class Torus_Item :public Base_Item {
private:
public:
	Torus_Item() = delete;
	Torus_Item(D3DXVECTOR3 pos);
	~Torus_Item();

	void Update(void)override;
	void Draw(void)override;
	void CollAction(Player* player)override;
};