//=============================================================================
//
// ステージ選択メニュー画面処理 [menu_stage.h]
// Author : 
//
//=============================================================================
#pragma once

#include "main.h"
#include "renderer.h"

//*****************************************************************************
// プロトタイプ宣言
//*****************************************************************************
HRESULT InitMenuStage(void);
void UninitMenuStage(void);
void UpdateMenuStage(void);
void DrawMenuStage(void);
