//=============================================================================
//
// デッキーメニュー画面処理 [menu_deck.h]
// Author : 
//
//=============================================================================
#pragma once

#include "main.h"
#include "renderer.h"

//*****************************************************************************
// プロトタイプ宣言
//*****************************************************************************
HRESULT InitMenuDeck(void);
void UninitMenuDeck(void);
void UpdateMenuDeck(void);
void DrawMenuDeck(void);
