/*==============================================================================

   辞書管理[dictionary.cpp]
														 Author :切田 海畝斗
														 Date   :2023/09/08
--------------------------------------------------------------------------------

==============================================================================*/
#include "dictionary.h"

//*****************************************************************************
// マクロ定義
//*****************************************************************************
#define FILENAME "data/DATA/dictionary.txt"

//*****************************************************************************
// グローバル変数
//*****************************************************************************
DICTIONARY g_Dictionary[DICTIONARY_NUM];

//*****************************************************************************
// プロトタイプ宣言
//*****************************************************************************
void RegistrationDictionary(void);
bool LoadDictionary(void);

//=============================================================================
// 初期化処理
//=============================================================================
void InitDictionary(void)
{
	for (int dictCnt = 0; dictCnt < DICTIONARY_NUM; dictCnt++)
	{
		g_Dictionary[dictCnt].word= "\0";
		g_Dictionary[dictCnt].use = false;
	}

	LoadDictionary();
	RegistrationDictionary();

}

//=============================================================================
// Dictionaryゲッター関数
//=============================================================================
DICTIONARY* GetDictionary(void)
{
	return g_Dictionary;
}

//=============================================================================
// 辞書の登録
//=============================================================================
void RegistrationDictionary(void)
{
	for (int dictCnt = 0; dictCnt < DICTIONARY_NUM; dictCnt++)
	{
		if (g_Dictionary[dictCnt].word != "\0")
		{
			g_Dictionary[dictCnt].use = true;
		}
	}
}

//=============================================================================
// 辞書の読み込み
//=============================================================================
bool LoadDictionary(void)
{
	//ファイルのオープン
	std::ifstream ifs(FILENAME);

	//ファイルがオープン出来なかったら
	if (ifs.fail())
	{
		return false;
	}

	//ファイルから読み込み
	std::string end = "END";
	for (int dictCnt = 0; dictCnt < DICTIONARY_NUM; dictCnt++)
	{
		std::string predict;
		ifs >> predict;
		if (predict != end)
		{
			g_Dictionary[dictCnt].word = predict;
		}
		else
		{
			break;
		}
	}

	//ファイルのクローズ
	ifs.close();

	return true;
}