/*==============================================================================

   操作説明BG管理[explanationBG.h]
														 Author :切田 海畝斗
														 Date   :2023/09/15
--------------------------------------------------------------------------------

==============================================================================*/
#pragma once
#ifndef _EXPLANATIONBG_H_
#define _EXPLANATIONBG_H_

#include "main.h"
#include "renderer.h"

//*****************************************************************************
// マクロ定義
//*****************************************************************************

//*****************************************************************************
// 構造体宣言
//*****************************************************************************
struct EXPLANATIONBG {
	D3DXVECTOR2		pos;	//位置ベクトル
	D3DXVECTOR2		size;	//サイズ
	D3DXVECTOR2		tex_v;	//可変テクスチャ座標
	D3DXVECTOR2		tex_f;	//固定テクスチャ座標
	D3DXCOLOR		color;	//カラー
	float			rot;
	bool			coll;
};


//*****************************************************************************
// プロトタイプ宣言
//*****************************************************************************
void InitExplanationBG(void);
void UninitExplanationBG(void);
void UpdateExplanationBG(void);
void DrawExplanationBG(void);
EXPLANATIONBG* GetExplanationBGButton(void);

#endif // !_EXPLANATIONBG_H_