/*==============================================================================

   フェード管理[fade.h]
														 Author :切田 海畝斗
														 Date   :2023/06/16
--------------------------------------------------------------------------------

==============================================================================*/
#pragma once
#ifndef _FADE_H_
#define _FADE_H_

#include "main.h"
#include "renderer.h"

//*****************************************************************************
// マクロ定義
//*****************************************************************************
#define SPEED_X 5
#define SPEED_Y 5
#define CYCLE_SPEED 0.05f
#define PI 3.15

//*************************
// 列挙体宣言
//*************************
typedef enum {
	FADE_NOT = 0,
	FADE_IN,
	FADE_OUT,
	FADE_MAX,	//フェードステートの個数
}MODE_FADE;

//*****************************************************************************
// 構造体宣言
//*****************************************************************************
struct FADE {
	D3DXVECTOR2		pos;	//位置ベクトル
	D3DXVECTOR2		size;	//サイズ
	D3DXVECTOR2		tex_v;	//可変テクスチャ座標
	D3DXVECTOR2		tex_f;	//固定テクスチャ座標
	D3DXCOLOR		color;	//カラー
};


//*****************************************************************************
// プロトタイプ宣言
//*****************************************************************************
void InitFade(void);
void UninitFade(void);
void UpdateFade(void);
void DrawFade(void);
void SetFade(MODE_FADE mode);
MODE_FADE* GetFade(void);

#endif // !_FADE_H_