/*==============================================================================

  設定管理[option.h]
														Author :切田 海畝斗
														Date   :2023/09/11
--------------------------------------------------------------------------------

==============================================================================*/
#pragma once
#ifndef _OPTION_H_
#define _OPTION_H_

//*****************************************************************************
// 列挙体宣言
//*****************************************************************************
enum OPTION_SETTING {
	VOLUME = 0,
	BGM,
	SE,
	COLOR,
	CURSOR,
	HIT_WORD
};
enum OPTION_ADJUSTMENT {
	BGM_VOLUME = 0,
	SE_VOLUME,
	CURSOR_R,
	CURSOR_G,
	CURSOR_B,
	HIT_WORD_R,
	HIT_WORD_G,
	HIT_WORD_B
};

//*****************************************************************************
// プロトタイプ宣言
//*****************************************************************************
void InitOption(void);
void UninitOption(void);
void UpdateOption(void);
void DrawOption(void);

#endif // !_OPTION_H_
