/*==============================================================================

  設定BG管理[option.h]
														Author :切田 海畝斗
														Date   :2023/09/11
--------------------------------------------------------------------------------

==============================================================================*/
#pragma once
#ifndef _OPTIONBG_H_
#define _OPTIONBG_H_

#include "main.h"
#include "renderer.h"

//*****************************************************************************
// マクロ定義
//*****************************************************************************
#define ADJUSTMENT_NUM 8
#define SETTING_NUM 6
//*****************************************************************************
// 構造体宣言
//*****************************************************************************
struct OPTION {
	D3DXVECTOR2		pos;	//位置ベクトル
	D3DXVECTOR2		size;	//サイズ
	D3DXVECTOR2		tex_v;	//可変テクスチャ座標
	D3DXVECTOR2		tex_f;	//固定テクスチャ座標
	D3DXCOLOR		color;	//カラー
	float			rot;
	bool			coll;
};

//*****************************************************************************
// プロトタイプ宣言
//*****************************************************************************
void InitOptionBG(void);
void UninitOptionBG(void);
void UpdateOptionBG(void);
void DrawOptionBG(void);
OPTION* GetAdCursor(void);
OPTION* GetOptionBGButton(void);

#endif // !_OPTIONBG_H_
