/*==============================================================================

   プレイヤー管理[player.h]
														 Author :切田 海畝斗
														 Date   :2023/06/16
--------------------------------------------------------------------------------

==============================================================================*/
#pragma once
#ifndef _PLAYER_H_
#define _PLAYER_H_

#include "main.h"
#include "renderer.h"

//*****************************************************************************
// マクロ定義
//*****************************************************************************
#define PALYER_COLL_SIZE 20.0f

//*****************************************************************************
// 列挙体宣言
//*****************************************************************************

//*****************************************************************************
// 構造体宣言
//*****************************************************************************
struct PLAYER {
	D3DXVECTOR2		pos;	//位置ベクトル
	D3DXVECTOR2		size;	//サイズ
	D3DXVECTOR2		tex_v;	//可変テクスチャ座標
	D3DXVECTOR2		tex_f;	//固定テクスチャ座標
	D3DXCOLOR		color;	//カラー
	bool			coll;
	bool			shoot;
	bool			grab;
	bool			stuck;
};


//*****************************************************************************
// プロトタイプ宣言
//*****************************************************************************
void InitPlayer(void);
void UninitPlayer(void);
void UpdatePlayer(void);
void DrawPlayer(void);
PLAYER* GetPlayer(void);
void SetPlayer(D3DXVECTOR2 pos, D3DXVECTOR2 size);
D3DXCOLOR CopyPlayerColor(void);
void SetPlayerColor(D3DXCOLOR color);

#endif // !_PLAYER_H_