/*==============================================================================

   リザルトBG管理 [resultBG.h]
														 Author :切田 海畝斗
														 Date   :2023/06/16
--------------------------------------------------------------------------------

==============================================================================*/
#pragma once
#ifndef _RESULTBG_H_
#define _RESULTBG_H_

#include "main.h"
#include "renderer.h"

//*****************************************************************************
// マクロ定義
//*****************************************************************************
#define RESULT_BUTTON_NUM 2

//*****************************************************************************
// 構造体宣言
//*****************************************************************************
struct RESULTBG {
	D3DXVECTOR2		pos;	//位置ベクトル
	D3DXVECTOR2		size;	//サイズ
	D3DXVECTOR2		tex_v;	//可変テクスチャ座標
	D3DXVECTOR2		tex_f;	//固定テクスチャ座標
	D3DXCOLOR		color;	//カラー
	float			rot;
	bool			coll;
};


//*****************************************************************************
// プロトタイプ宣言
//*****************************************************************************
void InitResultBG(void);
void UninitResultBG(void);
void UpdateResultBG(void);
void DrawResultBG(void);
RESULTBG* GetResultButton(void);

#endif // !_RESULTBG_H_