/*==============================================================================

   タイトルBG管理[titleBG.h]
														 Author :切田 海畝斗
														 Date   :2023/06/16
--------------------------------------------------------------------------------

==============================================================================*/
#pragma once
#ifndef _TITLEBG_H_
#define _TITLEBG_H_

#include "main.h"
#include "renderer.h"

//*****************************************************************************
// マクロ定義
//*****************************************************************************
#define TITLE_BUTTON_NUM 5

//*****************************************************************************
// 構造体宣言
//*****************************************************************************
struct TITLEBG {
	D3DXVECTOR2		pos;	//位置ベクトル
	D3DXVECTOR2		size;	//サイズ
	D3DXVECTOR2		tex_v;	//可変テクスチャ座標
	D3DXVECTOR2		tex_f;	//固定テクスチャ座標
	D3DXCOLOR		color;	//カラー
	float			rot;
	bool			coll;
};


//*****************************************************************************
// プロトタイプ宣言
//*****************************************************************************
void InitTitleBG(void);
void UninitTitleBG(void);
void UpdateTitleBG(void);
void DrawTitleBG(void);
TITLEBG* GetTitleButton(void);

#endif // !_TITLEBG_H_