/*==============================================================================

   タイトル管理 [title.cpp]
														 Author :切田 海畝斗
														 Date   :2023/06/16
--------------------------------------------------------------------------------

==============================================================================*/
#include "title.h"
#include "titleBG.h"
#include "input.h"
#include "fade.h"
#include "game.h"
#include "player.h"
#include "collision.h"
#include "sound.h"

//=============================================================================
// 初期化処理
//=============================================================================
void InitTitle(void)
{
	InitTitleBG();
	InitPlayer();
	InitCollColor();
	//ゲームモードの初期化
	SetGameDiff(NORMAL);

	//オーディオの初期化
	SOUND_RECORD* pSoundRecord = GetSoundRecord();
	PlaySound(pSoundRecord->SETitleID, 0);
}

//=============================================================================
// 終了処理
//=============================================================================
void UninitTitle(void)
{
	UninitTitleBG();
	UninitPlayer();
	StopSoundAll();
}

//=============================================================================
// 更新処理
//=============================================================================
void UpdateTitle(void)
{
	UpdatePlayer();
	UpdateTitleBG();
	UpdateCollision();
}

//=============================================================================
// 描画処理
//=============================================================================
void DrawTitle(void)
{
	DrawTitleBG();
	DrawPlayer();
}